** Table of size bins

|    |    a_min |    a_max | a, \mu{}m |  a, \AA |
|----+---------+---------+-------+-------|
| 01 |   0.005 | 0.00739 | 0.006 |   60. |
| 02 | 0.00739 | 0.01093 | 0.009 |   90. |
| 03 | 0.01093 | 0.01616 | 0.014 |  140. |
| 04 | 0.01616 | 0.02390 | 0.020 |  200. |
| 05 | 0.02390 | 0.03534 | 0.030 |  300. |
| 06 | 0.03534 | 0.05226 | 0.045 |  450. |
| 07 | 0.05226 | 0.07728 | 0.066 |  660. |
| 08 | 0.07728 | 0.11428 | 0.098 |  980. |
| 09 | 0.11428 | 0.16899 | 0.144 | 1440. |
| 10 | 0.16899 | 0.24990 | 0.213 | 2130. |
#+TBLFM: $3=1.478758 $-1 ;f5::$4=sqrt(0.5 ($2**2 + $3**2));f3::$5=10000*$-1::@3$2..@11$2=@-1$+1;f5

+ The mean a is weighted by area
** DONE Copy the generic models and turn off qheat
CLOSED: [2019-04-13 Sat 19:05]
+ Put everything in new folder [[file:models-no-qheat/]]
#+BEGIN_SRC python :results silent
  import glob

  infiles = glob.glob("models/dustrad*.in")

  for infile in infiles:
      with open(infile) as f:
          s = f.read()
      # Change the grains command to turn off quantum heating
      s = s.replace(
          "grains ism function sublimation",
          "grains ism function sublimation no qheat",
      )
      with open(infile.replace("models/", "models-no-qheat/"), "w") as f:
          f.write(s)
#+END_SRC

#+BEGIN_SRC sh :results verbatim :exports both
ls -l models-no-qheat/*.in
#+END_SRC

#+RESULTS:
#+begin_example
-rw-r--r--  1 will  staff  1105 Apr 13 18:55 models-no-qheat/dustrad-n00-BSG.in
-rw-r--r--  1 will  staff  1094 Apr 13 18:55 models-no-qheat/dustrad-n00-MS10.in
-rw-r--r--  1 will  staff  1107 Apr 13 18:55 models-no-qheat/dustrad-n00-MS20.in
-rw-r--r--  1 will  staff  1107 Apr 13 18:55 models-no-qheat/dustrad-n00-MS40.in
-rw-r--r--  1 will  staff  1107 Apr 13 18:55 models-no-qheat/dustrad-n01-BSG.in
-rw-r--r--  1 will  staff  1096 Apr 13 18:55 models-no-qheat/dustrad-n01-MS10.in
-rw-r--r--  1 will  staff  1109 Apr 13 18:55 models-no-qheat/dustrad-n01-MS20.in
-rw-r--r--  1 will  staff  1109 Apr 13 18:55 models-no-qheat/dustrad-n01-MS40.in
-rw-r--r--  1 will  staff  1109 Apr 13 18:55 models-no-qheat/dustrad-n02-BSG.in
-rw-r--r--  1 will  staff  1098 Apr 13 18:55 models-no-qheat/dustrad-n02-MS10.in
-rw-r--r--  1 will  staff  1112 Apr 13 18:55 models-no-qheat/dustrad-n02-MS20.in
-rw-r--r--  1 will  staff  1111 Apr 13 18:55 models-no-qheat/dustrad-n02-MS40.in
-rw-r--r--  1 will  staff  1111 Apr 13 18:55 models-no-qheat/dustrad-n03-BSG.in
-rw-r--r--  1 will  staff  1100 Apr 13 18:55 models-no-qheat/dustrad-n03-MS10.in
-rw-r--r--  1 will  staff  1114 Apr 13 18:55 models-no-qheat/dustrad-n03-MS20.in
-rw-r--r--  1 will  staff  1114 Apr 13 18:55 models-no-qheat/dustrad-n03-MS40.in
-rw-r--r--  1 will  staff  1113 Apr 13 18:55 models-no-qheat/dustrad-n04-BSG.in
-rw-r--r--  1 will  staff  1102 Apr 13 18:55 models-no-qheat/dustrad-n04-MS10.in
-rw-r--r--  1 will  staff  1116 Apr 13 18:55 models-no-qheat/dustrad-n04-MS20.in
-rw-r--r--  1 will  staff  1116 Apr 13 18:55 models-no-qheat/dustrad-n04-MS40.in
#+end_example

** Comparative timings
+ The models with ~no qheat~ are noticeably faster, but less than twice as fast
+ Average speedup factor = 7694.88/4502.76 = 1.71
#+BEGIN_SRC sh :results table
grep 'ExecTime(s)' models-no-qheat/dustrad*.out |cut -f 1,11 -d' '
#+END_SRC

#+RESULTS:
|---------------------------------------+---------|
| models-no-qheat/dustrad-n00-BSG.out:  |  160.74 |
| models-no-qheat/dustrad-n00-MS10.out: |  165.55 |
| models-no-qheat/dustrad-n00-MS20.out: |  227.74 |
| models-no-qheat/dustrad-n00-MS40.out: |  274.11 |
| models-no-qheat/dustrad-n01-BSG.out:  |  158.15 |
| models-no-qheat/dustrad-n01-MS10.out: |   161.9 |
| models-no-qheat/dustrad-n01-MS20.out: |   270.1 |
| models-no-qheat/dustrad-n01-MS40.out: |  311.88 |
| models-no-qheat/dustrad-n02-BSG.out:  |  199.27 |
| models-no-qheat/dustrad-n02-MS10.out: |  205.32 |
| models-no-qheat/dustrad-n02-MS20.out: |  279.47 |
| models-no-qheat/dustrad-n02-MS40.out: |  309.77 |
| models-no-qheat/dustrad-n03-BSG.out:  |   188.6 |
| models-no-qheat/dustrad-n03-MS10.out: |   195.7 |
| models-no-qheat/dustrad-n03-MS20.out: |  268.22 |
| models-no-qheat/dustrad-n03-MS40.out: |  282.97 |
| models-no-qheat/dustrad-n04-BSG.out:  |  193.87 |
| models-no-qheat/dustrad-n04-MS10.out: |  190.01 |
| models-no-qheat/dustrad-n04-MS20.out: |  223.46 |
| models-no-qheat/dustrad-n04-MS40.out: |  235.93 |
|---------------------------------------+---------|
|                                       | 4502.76 |
#+TBLFM: @21$2=vsum(@I..@II)

#+BEGIN_SRC sh :results table
grep 'ExecTime(s)' models/dustrad*.out |cut -f 1,11 -d' '
#+END_SRC

#+RESULTS:
|------------------------------+---------|
| models/dustrad-n00-BSG.out:  |  236.17 |
| models/dustrad-n00-MS10.out: |  249.66 |
| models/dustrad-n00-MS20.out: |  353.36 |
| models/dustrad-n00-MS40.out: |   440.9 |
| models/dustrad-n01-BSG.out:  |  226.82 |
| models/dustrad-n01-MS10.out: |  234.51 |
| models/dustrad-n01-MS20.out: |  384.26 |
| models/dustrad-n01-MS40.out: |  465.55 |
| models/dustrad-n02-BSG.out:  |  265.22 |
| models/dustrad-n02-MS10.out: |  275.79 |
| models/dustrad-n02-MS20.out: |  405.35 |
| models/dustrad-n02-MS40.out: |   523.9 |
| models/dustrad-n03-BSG.out:  |  278.17 |
| models/dustrad-n03-MS10.out: |   288.9 |
| models/dustrad-n03-MS20.out: |  455.45 |
| models/dustrad-n03-MS40.out: |  551.47 |
| models/dustrad-n04-BSG.out:  |   274.5 |
| models/dustrad-n04-MS10.out: |  284.98 |
| models/dustrad-n04-MS20.out: |  448.18 |
| models/dustrad-n04-MS40.out: | 1051.74 |
|------------------------------+---------|
|                              | 7694.88 |
#+TBLFM: @21$2=vsum(@I..@II)




*** Grain emissivity versus U
:PROPERTIES:
:ID:       EDB6BD6B-0BBE-4EDF-B781-416487E6801C
:END:
+ We divide by number density to put the emissivity as per nucleon
+ Cloudy reports integral across frequency band, so we need to divide by filter width \Delta\nu to put it in per Hz.  From the following table,  \Delta\nu = 1.2491e12 Hz
  | Band    |   \lambda_1 |   \lambda_2 |        \nu_1 |        \nu_2 |        \Delta\nu |
  |---------+------+------+-----------+-----------+-----------|
  | IRAC 8  |  6.5 |  9.3 | 4.6122e13 | 3.2236e13 | 1.3886e13 |
  | MIPS 24 | 20.8 | 26.1 | 1.4413e13 | 1.1486e13 |  2.927e12 |
  | F 25    |   19 |   30 | 1.5779e13 | 9.9931e12 | 5.7859e12 |
  | PAC 70  |   60 |   80 | 4.9965e12 | 3.7474e12 | 1.2491e12 |
  | PAC 160 |  130 |  198 | 2.3061e12 | 1.5141e12 |   7.92e11 |
  #+TBLFM: $4=$c / $2 $micron; s5::$5=$c / $3 $micron; s5::$6=$-2 - $-1;s5
+ First, just look at the 70 micron emission
+ Cloudy gives emissivity in erg/cm^3/s
  + So we need to divide by 4\pi \Delta\nu n 10^-23 to put it in Jy.cm^2/sr/H
#+name: grain-j70-vs-U-plot
#+BEGIN_SRC python :return pltfile :results file :exports both
  import numpy as np
  from matplotlib import pyplot as plt
  import seaborn as sns
  from astropy.table import Table
  from astropy import units as u
  from astropy.constants import k_B
  from cloudytab import CloudyModel

  pltfile = f'grain-j70-vs-U.pdf'
  sns.set_color_codes("bright")
  fig, ax = plt.subplots(figsize=(4,4))

  F_habing = 1.6e-3
  F_mathis = 0.0217
  light_speed = 2.99792458e10
  kB = 1.3806503e-16
  bandwidth70 = 1.2491e12 
  Jy = 1e-23
  stars = [
      ["MS10", 0.63, 'Purples_d'   ],
      ["MS20", 5.45, 'Oranges_d'],
      ["MS40", 22.2, 'Blues_d'  ],
      ["BSG", 30.2,  'Greens_d' ]
  ]

  denids = [f"n0{_}" for _ in range(5)]

  # Data from Draine:2007a
  DL07tab = Table.read('DL07-data/emissivities.fits')

  for star, L4, cmap in stars:
      L = 1e4*3.82e33*L4
      cols = sns.color_palette(cmap, n_colors=len(denids))
      for denid, col in zip(denids, cols):
          # Read model 
          prefix = f"dustrad-{denid}-{star}"
          try:
              m = CloudyModel(f'models/{prefix}')
          except:
              continue

          Prad = m.data['flux']['F']/light_speed
          R = m.data['rad']['radius']
          F = L / (4*np.pi*R**2)
          U = F / F_mathis
          hden = m.data['ovr']['hden']
          eden = m.data['ovr']['eden']
          Te = m.data['ovr']['Te']
          Pgas = (hden + eden)*kB*Te
          U[eden < 0.5*hden] = np.nan
          j70 = m.data['emis']['PAC1 70.0000m'] / (4*np.pi*hden*bandwidth70*Jy)
          ax.plot(U, j70, alpha=0.8, lw=1, color=col)

  ax.plot(DL07tab['U'], DL07tab['70'], 'o', alpha=0.5, color='k')
  ax.plot(DL07tab['U']/8.0, DL07tab['70'], 'o', alpha=0.2, color='k')
  ax.set(
      yscale='log',
      xscale='log',
      xlabel=r'Radiation field: $U = L_*\, /\, (4 \pi \,R^{2} \, c \, u_{\mathrm{MMP83}})$',
      ylabel=r'Emissivity at 70 $\mu$m: $j_\nu$   [Jy cm$^{2}$ sr$^{-1}$ H$^{-1}$]',
      #xlim=[1.0, 1.e6],
  )

  sns.despine()
  fig.tight_layout()
  fig.savefig(pltfile)

#+END_SRC

#+RESULTS: grain-j70-vs-U-plot
[[file:grain-j70-vs-U.pdf]]

#+name: grain-j24-vs-U-plot
#+BEGIN_SRC python :return pltfile :results file :exports both
  import numpy as np
  from matplotlib import pyplot as plt
  import seaborn as sns
  from astropy.table import Table
  from astropy import units as u
  from astropy.constants import k_B
  from cloudytab import CloudyModel

  pltfile = f'grain-j24-vs-U.pdf'
  sns.set_color_codes("bright")
  fig, ax = plt.subplots(figsize=(4,4))

  F_habing = 1.6e-3
  F_mathis = 0.0217
  light_speed = 2.99792458e10
  kB = 1.3806503e-16
  bandwidth24 = 2.927e12
  Jy = 1e-23
  stars = [
      ["MS10", 0.63, 'Purples_d'   ],
      ["MS20", 5.45, 'Oranges_d'],
      ["MS40", 22.2, 'Blues_d'  ],
      ["BSG", 30.2,  'Greens_d' ]
  ]

  denids = [f"n0{_}" for _ in range(5)]

  # Data from Draine:2007a
  DL07tab = Table.read('DL07-data/emissivities.fits')

  for star, L4, cmap in stars:
      L = 1e4*3.82e33*L4
      cols = sns.color_palette(cmap, n_colors=len(denids))
      for denid, col in zip(denids, cols):
          # Read model 
          prefix = f"dustrad-{denid}-{star}"
          try:
              m = CloudyModel(f'models-pah/{prefix}')
          except:
              continue

          R = m.data['rad']['radius']
          F = L / (4*np.pi*R**2)
          U = F / F_mathis
          hden = m.data['ovr']['hden']
          eden = m.data['ovr']['eden']
          Te = m.data['ovr']['Te']
          Pgas = (hden + eden)*kB*Te
          U[eden < 0.5*hden] = np.nan
          j24 = m.data['emis']['MIPS 24.0000m'] / (4*np.pi*hden*bandwidth24*Jy)
          ax.plot(U, j24, alpha=0.8, lw=1, color=col)

  ax.plot(DL07tab['U'], DL07tab['24'], 'o', alpha=0.5, color='k')
  ax.plot(DL07tab['U']/8.0, DL07tab['24'], 'o', alpha=0.1, color='k')
  ax.set(
      yscale='log',
      xscale='log',
      xlabel=r'Radiation field: $U = L_*\, /\, (4 \pi \,R^{2} \, c \, u_{\mathrm{MMP83}})$',
      ylabel=r'Emissivity at 24 $\mu$m: $j_\nu$   [Jy cm$^{2}$ sr$^{-1}$ H$^{-1}$]',
      #xlim=[1.0, 1.e6],
  )

  sns.despine()
  fig.tight_layout()
  fig.savefig(pltfile)

#+END_SRC

#+RESULTS: grain-j24-vs-U-plot
[[file:grain-j24-vs-U.pdf]]

Now look at flux ratios between bands

#+name: grain-jratios-vs-U-plot
#+BEGIN_SRC python :return pltfile :results file :exports both
  import numpy as np
  from matplotlib import pyplot as plt
  import seaborn as sns
  from astropy.table import Table
  from astropy import units as u
  from astropy.constants import k_B
  from cloudytab import CloudyModel

  pltfile = f'grain-jratios-vs-U.pdf'
  sns.set_color_codes("bright")
  fig, axes = plt.subplots(3, 1, sharex=True, figsize=(6,9))

  F_habing = 1.6e-3
  F_mathis = 0.0217
  light_speed = 2.99792458e10
  kB = 1.3806503e-16
  bandwidth70 = 1.2491e12 
  Jy = 1e-23
  stars = [
      ["MS10", 0.63, 'Purples_d'   ],
      ["MS20", 5.45, 'Oranges_d'],
      ["MS40", 22.2, 'Blues_d'  ],
      ["BSG", 30.2,  'Greens_d' ]
  ]

  denids = [f"n0{_}" for _ in range(5)]

  dnu8, dnu24, dnu70, dnu160 = 1.3886e13, 2.927e12, 1.2491e12, 7.92e11

  # Data from Draine:2007a
  DL07tab = Table.read('DL07-data/emissivities.fits')

  for star, L4, cmap in stars:
      L = 1e4*3.82e33*L4
      cols = sns.color_palette(cmap, n_colors=len(denids))
      for denid, col in zip(denids, cols):
          # Read model 
          prefix = f"dustrad-{denid}-{star}"
          try:
              m = CloudyModel(f'models/{prefix}')
          except:
              continue

          Prad = m.data['flux']['F']/light_speed
          R = m.data['rad']['radius']
          F = L / (4*np.pi*R**2)
          U = F / F_mathis
          hden = m.data['ovr']['hden']
          eden = m.data['ovr']['eden']
          Te = m.data['ovr']['Te']
          Pgas = (hden + eden)*kB*Te
          U[eden < 0.5*hden] = np.nan
          r24_8 = m.data['emis']['MIPS 24.0000m'] / m.data['emis']['IRAC 8.00000m'] 
          r70_24 = m.data['emis']['PAC1 70.0000m'] / m.data['emis']['MIPS 24.0000m']
          r160_70 = m.data['emis']['PAC3 160.000m'] / m.data['emis']['PAC1 70.0000m']
          r24_8 *= dnu8/dnu24
          r70_24 *= dnu24/dnu70
          r160_70 *= dnu160/dnu70
          axes[0].plot(U, r24_8, alpha=0.8, lw=1, color=col)
          axes[1].plot(U, r70_24, alpha=0.8, lw=1, color=col)
          axes[2].plot(U, r160_70, alpha=0.8, lw=1, color=col)

  axes[0].plot(DL07tab['U']/8, DL07tab['24']/ DL07tab['8'], 'o', alpha=0.5)
  axes[1].plot(DL07tab['U']/8, DL07tab['70']/ DL07tab['24'], 'o', alpha=0.5)
  axes[2].plot(DL07tab['U']/8, DL07tab['170']/ DL07tab['70'], 'o', alpha=0.5)
  #ax.plot(DL07tab['U']*0.1, DL07tab['70'], 'o', alpha=0.1)
  for ax in axes:
      ax.set(yscale='log', xscale='log')
  axes[0].set(
      ylabel=r'24 / 8',
  )
  axes[1].set(
      ylabel=r'70 / 24',
  )
  axes[2].set(
      xlabel='Radiation field: $U$',
      ylabel=r'160 / 70',
  )

  sns.despine()
  fig.tight_layout()
  fig.savefig(pltfile)

#+END_SRC

#+RESULTS: grain-jratios-vs-U-plot
[[file:grain-jratios-vs-U.pdf]]

And now the color-color plots

#+name: grain-color-color-plot
#+BEGIN_SRC python :return pltfile :results file :exports both
  import numpy as np
  from matplotlib import pyplot as plt
  import seaborn as sns
  from astropy.table import Table
  from astropy import units as u
  from astropy.constants import k_B
  from cloudytab import CloudyModel

  pltfile = f'grain-color-color.pdf'
  sns.set_color_codes("bright")
  fig, axes = plt.subplots(2, 1, figsize=(4,8))

  F_habing = 1.6e-3
  F_mathis = 0.0217
  light_speed = 2.99792458e10
  kB = 1.3806503e-16
  bandwidth70 = 1.2491e12 
  Jy = 1e-23
  stars = [
      ["MS10", 0.63, 'Purples_d'   ],
      ["MS20", 5.45, 'Oranges_d'],
      ["MS40", 22.2, 'Blues_d'  ],
      ["BSG", 30.2,  'Greens_d' ]
  ]

  denids = [f"n0{_}" for _ in range(5)]

  dnu8, dnu24, dnu70, dnu160 = 1.3886e13, 2.927e12, 1.2491e12, 7.92e11

  # Data from Draine:2007a
  DL07tab = Table.read('DL07-data/emissivities.fits')

  for star, L4, cmap in stars:
      L = 1e4*3.82e33*L4
      cols = sns.color_palette(cmap, n_colors=len(denids))
      for denid, col in zip(denids, cols):
          # Read model 
          prefix = f"dustrad-{denid}-{star}"
          try:
              m = CloudyModel(f'models/{prefix}')
          except:
              continue

          Prad = m.data['flux']['F']/light_speed
          R = m.data['rad']['radius']
          F = L / (4*np.pi*R**2)
          U = F / F_mathis
          hden = m.data['ovr']['hden']
          eden = m.data['ovr']['eden']
          Te = m.data['ovr']['Te']
          Pgas = (hden + eden)*kB*Te
          U[eden < 0.5*hden] = np.nan
          r24_8 = m.data['emis']['MIPS 24.0000m'] / m.data['emis']['IRAC 8.00000m'] 
          r70_24 = m.data['emis']['PAC1 70.0000m'] / m.data['emis']['MIPS 24.0000m']
          r160_70 = m.data['emis']['PAC3 160.000m'] / m.data['emis']['PAC1 70.0000m']
          r24_8 *= dnu8/dnu24
          r70_24 *= dnu24/dnu70
          r160_70 *= dnu160/dnu70
          axes[0].plot(r24_8, r70_24, alpha=0.8, lw=1, color=col)
          axes[1].plot(r70_24, r160_70, alpha=0.8, lw=1, color=col)

  axes[0].plot(DL07tab['24']/ DL07tab['8'],  DL07tab['70']/ DL07tab['24'], 'o', alpha=0.5)
  axes[1].plot(DL07tab['70']/ DL07tab['24'], DL07tab['170']/ DL07tab['70'], 'o', alpha=0.5)
  #ax.plot(DL07tab['U']*0.1, DL07tab['70'], 'o', alpha=0.1)
  for ax in axes:
      ax.set(yscale='log', xscale='log')
  axes[0].set(
      xlabel=r'24 / 8',
      ylabel=r'70 / 24',
  )
  axes[1].set(
      xlabel=r'70 / 24',
      ylabel=r'160 / 70',
  )

  sns.despine()
  fig.tight_layout()
  fig.savefig(pltfile)

#+END_SRC

#+RESULTS: grain-color-color-plot
[[file:grain-color-color.pdf]]

*** Collate emissivities from Draine:2007a
#+name: dl07-emissivities
#+BEGIN_SRC python :return data 
  import glob

  folders = glob.glob('DL07-data/U*')

  header = [['U', '8', '24', '70', '110', '170'], None]
  data = []
  for folder in folders:
      _, Ustring = folder.split('U')
      U = float(Ustring)
      datafile = f'U{Ustring}_{Ustring}_MW3.1_00.txt'
      with open(folder + '/' + datafile) as f:
          lines = f.readlines()
      j70, j110, j170 = [float(_.split()[2]) for _ in lines if 'PAC' in _]
      j24, _, _ = [float(_.split()[2]) for _ in lines if 'SST-MIPS' in _]
      _, _, _, j8 = [float(_.split()[2]) for _ in lines if 'SST-IRAC' in _]
      data.append([U, j8, j24, j70, j110, j170])

  data.sort(key=lambda x: x[0])
  data = header + data

#+END_SRC

#+RESULTS: dl07-emissivities
|        U |         8 |        24 |        70 |       110 |       170 |
|----------+-----------+-----------+-----------+-----------+-----------|
|      0.1 | 2.124e-18 | 8.856e-18 | 9.302e-17 | 3.393e-16 | 1.139e-15 |
|     0.15 | 3.184e-18 | 1.337e-17 | 1.731e-16 | 6.078e-16 | 1.736e-15 |
|      0.2 | 4.246e-18 | 1.793e-17 | 2.661e-16 | 8.962e-16 | 2.316e-15 |
|      0.3 | 6.375e-18 | 2.714e-17 | 4.845e-16 | 1.523e-15 | 3.432e-15 |
|      0.4 | 8.499e-18 | 3.654e-17 | 7.624e-16 | 2.208e-15 | 4.449e-15 |
|      0.5 | 1.062e-17 | 4.599e-17 | 1.052e-15 | 2.903e-15 | 5.448e-15 |
|      0.7 | 1.488e-17 | 6.538e-17 | 1.737e-15 | 4.346e-15 | 7.253e-15 |
|      0.8 | 1.701e-17 | 7.518e-17 | 2.104e-15 | 5.078e-15 | 8.112e-15 |
|      1.0 | 2.127e-17 | 9.479e-17 | 2.838e-15 | 6.544e-15 |  9.83e-15 |
|      1.2 | 2.555e-17 | 1.154e-16 |  3.72e-15 | 8.014e-15 | 1.125e-14 |
|      1.5 | 3.197e-17 | 1.463e-16 | 5.043e-15 | 1.022e-14 | 1.339e-14 |
|      2.0 | 4.265e-17 | 1.994e-16 | 7.383e-15 | 1.382e-14 | 1.663e-14 |
|      2.5 |  5.33e-17 | 2.545e-16 | 9.895e-15 | 1.734e-14 | 1.948e-14 |
|      3.0 | 6.395e-17 | 3.096e-16 | 1.241e-14 | 2.085e-14 | 2.233e-14 |
|      4.0 | 8.537e-17 | 4.283e-16 | 1.777e-14 | 2.739e-14 | 2.696e-14 |
|      5.0 | 1.068e-16 | 5.486e-16 |  2.32e-14 | 3.383e-14 | 3.137e-14 |
|      7.0 | 1.498e-16 | 8.091e-16 | 3.429e-14 | 4.566e-14 | 3.872e-14 |
|      8.0 | 1.713e-16 | 9.439e-16 | 3.988e-14 | 5.133e-14 | 4.205e-14 |
|     12.0 |  2.58e-16 | 1.524e-15 | 6.211e-14 | 7.231e-14 | 5.361e-14 |
|     15.0 | 3.233e-16 |  1.99e-15 | 7.867e-14 | 8.677e-14 | 6.097e-14 |
|     20.0 | 4.328e-16 |  2.83e-15 | 1.056e-13 |  1.09e-13 |  7.17e-14 |
|     25.0 | 5.431e-16 |  3.75e-15 | 1.318e-13 | 1.288e-13 | 8.053e-14 |
|    100.0 | 2.276e-15 |  2.28e-14 | 4.691e-13 | 3.404e-13 | 1.608e-13 |
|    300.0 |  7.62e-15 | 1.088e-13 | 1.118e-12 | 6.544e-13 | 2.562e-13 |
|   1000.0 | 3.299e-14 | 6.326e-13 | 2.606e-12 | 1.239e-12 | 4.081e-13 |
|   3000.0 | 1.433e-13 | 3.124e-12 | 5.127e-12 | 2.068e-12 | 5.974e-13 |
|  10000.0 | 7.118e-13 | 1.585e-11 | 1.004e-11 | 3.467e-12 | 8.887e-13 |
|  30000.0 | 3.018e-12 | 6.033e-11 | 1.736e-11 | 5.323e-12 | 1.249e-12 |
| 100000.0 | 1.663e-11 |  2.14e-10 | 3.021e-11 | 8.324e-12 | 1.803e-12 |
| 300000.0 | 9.378e-11 | 5.503e-10 | 4.696e-11 | 1.202e-11 | 2.463e-12 |


Write the above table to FITS format
#+BEGIN_SRC python :var TAB=dl07-emissivities :colnames no :return tab
  from astropy.table import Table
  tab = Table(rows=TAB[1:], names=TAB[0])
  tab.write('DL07-data/emissivities.fits', overwrite=True)
#+END_SRC

#+RESULTS:
#+begin_example
U         8         24        70       110       170   
-------- --------- --------- --------- --------- ---------
     0.1 2.124e-18 8.856e-18 9.302e-17 3.393e-16 1.139e-15
    0.15 3.184e-18 1.337e-17 1.731e-16 6.078e-16 1.736e-15
     0.2 4.246e-18 1.793e-17 2.661e-16 8.962e-16 2.316e-15
     0.3 6.375e-18 2.714e-17 4.845e-16 1.523e-15 3.432e-15
     0.4 8.499e-18 3.654e-17 7.624e-16 2.208e-15 4.449e-15
     0.5 1.062e-17 4.599e-17 1.052e-15 2.903e-15 5.448e-15
     0.7 1.488e-17 6.538e-17 1.737e-15 4.346e-15 7.253e-15
     0.8 1.701e-17 7.518e-17 2.104e-15 5.078e-15 8.112e-15
     1.0 2.127e-17 9.479e-17 2.838e-15 6.544e-15  9.83e-15
     1.2 2.555e-17 1.154e-16  3.72e-15 8.014e-15 1.125e-14
     ...       ...       ...       ...       ...       ...
    15.0 3.233e-16  1.99e-15 7.867e-14 8.677e-14 6.097e-14
    20.0 4.328e-16  2.83e-15 1.056e-13  1.09e-13  7.17e-14
    25.0 5.431e-16  3.75e-15 1.318e-13 1.288e-13 8.053e-14
   100.0 2.276e-15  2.28e-14 4.691e-13 3.404e-13 1.608e-13
   300.0  7.62e-15 1.088e-13 1.118e-12 6.544e-13 2.562e-13
  1000.0 3.299e-14 6.326e-13 2.606e-12 1.239e-12 4.081e-13
  3000.0 1.433e-13 3.124e-12 5.127e-12 2.068e-12 5.974e-13
 10000.0 7.118e-13 1.585e-11 1.004e-11 3.467e-12 8.887e-13
 30000.0 3.018e-12 6.033e-11 1.736e-11 5.323e-12 1.249e-12
100000.0 1.663e-11  2.14e-10 3.021e-11 8.324e-12 1.803e-12
300000.0 9.378e-11 5.503e-10 4.696e-11 1.202e-11 2.463e-12
Length = 30 rows
#+end_example

